// จงเขียนโปรแกรมคำนวณค่าเรียนพิเศษของ ติวเตอร์คณิตศาสตร์ แห่งหนึ่ง โดย ติวเตอร์แห่งนี้ คิดค่าเรียนเป็นรายชั่วโมง ชั่วโมงละ 450 บาท 
// และจ่ายเป็นแบบครั้งต่อครั้ง โดยให้โปรแกรมมีการรับค่าจำนวนช่วงโมงที่สอน 
// และมีรูปแบบการทำงานและแสดงผลตามตัวอย่างต่อไปนี้

// ตัวอย่างการทำงาน ครั้งที่ 1

// RUN : ทดสอบด้วยการป้อนจำนวนชั่วโมงที่เรียนเป็น 5 ชั่วโมง

// Enter Hour : 5
// Total : 2250
// RUNFILE: node q.js

const input = require('prompt-sync')()
const hour = input("จำนวนชั่วโมงที่เรียน = ")
tutor = (increase, total) => {
    while(increase < hour){
        increase++
        total += 450
    }
    console.log("Total : " + total);
}
tutor(1, 450)
