// ปลากระป๋องยี่ห้อหนึ่งใช้ปลาซูาร์ดีนสามตัวและมะเขือเทศสองผลเพื่อผลิตปลากระป๋องหนึ่งกระป๋อง หากโรงงาน
// ผลิตมีปลาซูาร์ดีนอยู่ 300 ตัวและมะเขือเทศอยู่ 200 ผล โรงงานจะผลิตปลากระป๋องได้ทั้งหมดกี่กระป๋อง และจะมี
// วัตถุดิบแต่ละอย่างคงเหลือเท่าใดบ้าง
// RUNFILE: node g.js

var fish = 3
var tomato = 2
var cannedfish = 0

function manufacture() {
    if (fish == 3 && tomato == 2) {
        while (fish <= 300 && tomato <= 200) {
            fish += 3
            tomato += 2
                ++cannedfish
        };
        console.log("ผลิดปลากระป๋องได้ทั้งหมด " + cannedfish);
        // ปลากับมะเขือเทศใช้วัตถุดิบหมด
    } else {
        console.log("วัตถุดิบไม่พอ");
    }
}
manufacture()

// output: 100